app/controllers/oauth_controller.rb

INSERT INTO "users" ("access_token", "created_at", "full_name", "instagram_id", "prof_pic", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "users".* FROM "users"  WHERE "users"."instagram_id" = '3172303' LIMIT 1
---
  def callback
    response = Instagram.get_access_token(params[:code], :redirect_uri => CALLBACK_URL)
    session[:access_token] = response.access_token
    puts '**************'
    puts response
    print response
    puts response.access_token
    print response.access_token
    puts '**************'

    # todo: create a user with this information
    # access_token, username, full_name, prof_pic, instragram_id
    u = User.find_by(instagram_id: response.user.id) || User.create!(access_token: response.access_token, username: response.user.username,
      full_name: response.user.full_name, prof_pic: response.user.profile_picture, instagram_id: response.user.id)