app/controllers/photos_controller.rb

  def saver
    photo_url = params['photo_url']
    user_id = params['user_id']

    # Create a photo with a reference to a user and save to database
    Photo.create!(photo_url: photo_url, user_id: user_id)
---
INSERT INTO "photos" ("created_at", "photo_url", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"

  def photo_finder
    @photos = Photo.where(user_id: @current_user.id)
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = 1